Revit 2024 API
TextNode.IsKeptReadable Property
 Indicates text behavior inside a rotated text object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsKeptReadable { get; }
Visual Basic
Public ReadOnly Property IsKeptReadable As Boolean
	Get
Visual C++
public:
property bool IsKeptReadable {
	bool get ();
}
Remarks
If the property is True then the text inside the text box gets oriented so it is readable when looking straight up at the sheet or from its right side; in other words, the text would never be upside down.
If the value is False, however, the text's orientation strictly follows the rotation of the text box, which means the text may be upside down when viewed on screen or printed on a sheet.
See Also
TextNode Class
Autodesk.Revit.DB Namespace